Revit 2027 API
MultiReferenceAnnotationOptions.ReferencesDontMatchReferenceCategory Method
 Verifies that all of the references belongs to elements which doesn't match the reference category required by the MultiReferenceAnnotationType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ReferencesDontMatchReferenceCategory(
	IList<Reference> references
)
Public Function ReferencesDontMatchReferenceCategory (
	references As IList(Of Reference)
) As Boolean
public:
bool ReferencesDontMatchReferenceCategory(
	IList<Reference^>^ references
)
member ReferencesDontMatchReferenceCategory :
        references : IList<Reference> -> bool
Parameters
references IList<Reference>
 The references to test.
Return Value
Boolean
 Returns true if the element categories of all tested references do not match the element category required by the MultiReferenceAnnotationType.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MultiReferenceAnnotationOptions Class
Autodesk.Revit.DB Namespace